Jerry-ESP/esp-matter/awox_light/common/platform/ESP32_custom/nimble/BLEManagerImpl.cpp
/*
 *
 *    Copyright (c) 2020-2021 Project CHIP Authors
 *    All rights reserved.
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

/**
 *    @file
 *          Provides an implementation of the BLEManager singleton object
 *          for the ESP32 (NimBLE) platform.
 */
/* this file behaves like a config.h, comes first */
#include <platform/internal/CHIPDeviceLayerInternal.h>

#if CHIP_DEVICE_CONFIG_ENABLE_CHIPOBLE

#include "sdkconfig.h"

#if CONFIG_BT_NIMBLE_ENABLED

#if CONFIG_ENABLE_ESP32_BLE_CONTROLLER
#include <ble/BleLayer.h>
#endif
#include <ble/CHIPBleServiceData.h>
#include <lib/support/CodeUtils.h>
#include <lib/support/logging/CHIPLogging.h>
#include <platform/CommissionableDataProvider.h>
#include <platform/DeviceInstanceInfoProvider.h>
#if CONFIG_ENABLE_ESP32_BLE_CONTROLLER
#include <platform/ESP32/BLEManagerImpl.h>
#endif
#include <platform/internal/BLEManager.h>
#include <setup_payload/AdditionalDataPayloadGenerator.h>
#include <system/SystemTimer.h>
#include "esp_mac.h"
#include "esp_bt.h"
#include "esp_log.h"
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
#include "esp_nimble_hci.h"
#endif
#if CONFIG_ENABLE_ESP32_BLE_CONTROLLER
#include "blecent.h"
#endif
#include "host/ble_hs.h"
#include "host/ble_hs_pvcy.h"
#include "host/ble_uuid.h"
#include "host/util/util.h"
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "services/gap/ble_svc_gap.h"
#include "services/gatt/ble_svc_gatt.h"

#include "platform/ESP32_custom/BleManager/Characteristics/BleDataNotificationChr.hpp"
#include "platform/ESP32_custom/BleManager/Characteristics/BleFastOtaChr.hpp"
#include "platform/ESP32_custom/BleManager/BleManager.hpp"
#include "platform/ESP32_custom/BleManager/Characteristics/BlePairingChr.hpp"

#ifdef __cplusplus
extern "C" {
#endif
/**
 * @brief Just a template for later use, the implementation is in the ble stack
 *
 */
void ble_store_config_init(void);
#ifdef __cplusplus
}
#endif

#define MAX_ADV_DATA_LEN 31
#define CHIP_ADV_DATA_TYPE_FLAGS 0x01
#define CHIP_ADV_DATA_FLAGS 0x06
#define CHIP_ADV_DATA_TYPE_SERVICE_DATA 0x16
#define MANUFACTURER_DATA_FLAG 0xFF
#define COMPLETE_LOCAL_NAME_DATA_FLAG 0x09

using namespace ::chip;
using namespace ::chip::Ble;

namespace chip {
namespace DeviceLayer {
namespace Internal {

namespace {

#ifdef CONFIG_ENABLE_ESP32_BLE_CONTROLLER
static constexpr uint16_t kNewConnectionScanTimeout = 60;
static constexpr uint16_t kConnectTimeout           = 20;
#endif

struct ESP32ChipServiceData
{
    uint8_t ServiceUUID[2];
    ChipBLEDeviceIdentificationInfo DeviceIdInfo;
};

const ble_uuid16_t ShortUUID_CHIPoBLEService = { BLE_UUID_TYPE_16, 0xFFF6 };

#if CONFIG_ENABLE_ESP32_BLE_CONTROLLER
const ble_uuid16_t ShortUUID_CHIPoBLE_CharTx_Desc = { BLE_UUID_TYPE_16, 0x2902 };
#endif

const ble_uuid128_t UUID128_CHIPoBLEChar_RX = {
    BLE_UUID_TYPE_128, { 0x11, 0x9D, 0x9F, 0x42, 0x9C, 0x4F, 0x9F, 0x95, 0x59, 0x45, 0x3D, 0x26, 0xF5, 0x2E, 0xEE, 0x18 }
};
const ChipBleUUID chipUUID_CHIPoBLEChar_RX = { { 0x18, 0xEE, 0x2E, 0xF5, 0x26, 0x3D, 0x45, 0x59, 0x95, 0x9F, 0x4F, 0x9C, 0x42, 0x9F,
                                                 0x9D, 0x11 } };

const ChipBleUUID chipUUID_CHIPoBLEChar_TX = { { 0x18, 0xEE, 0x2E, 0xF5, 0x26, 0x3D, 0x45, 0x59, 0x95, 0x9F, 0x4F, 0x9C, 0x42, 0x9F,
                                                 0x9D, 0x12 } };
const ble_uuid128_t UUID_CHIPoBLEChar_TX   = {
    { BLE_UUID_TYPE_128 }, { 0x12, 0x9D, 0x9F, 0x42, 0x9C, 0x4F, 0x9F, 0x95, 0x59, 0x45, 0x3D, 0x26, 0xF5, 0x2E, 0xEE, 0x18 }
};

/** Service */
const ble_uuid128_t gattSvrSvcUuid
    = BLE_UUID128_INIT(0x10, 0x19, 0x0d, 0x0c, 0x0b, 0x0a, 0x09, 0x08, 0x07, 0x06, 0x05, 0x04, 0x03, 0x02, 0x01, 0x00);

/** Pairing characteristic */
const ble_uuid128_t gattPairingChrUuid
    = BLE_UUID128_INIT(0x14, 0x19, 0x0d, 0x0c, 0x0b, 0x0a, 0x09, 0x08, 0x07, 0x06, 0x05, 0x04, 0x03, 0x02, 0x01, 0x00);

/** Pairing descriptor */
const ble_uuid16_t gattPairingDscUuid = BLE_UUID16_INIT(0x2901);

/** Data Client to Server characteristic */
const ble_uuid128_t gattDataCommandChrUuid
    = BLE_UUID128_INIT(0x12, 0x19, 0x0d, 0x0c, 0x0b, 0x0a, 0x09, 0x08, 0x07, 0x06, 0x05, 0x04, 0x03, 0x02, 0x01, 0x00);

/** Data Client to Server descriptor */
const ble_uuid16_t gattDataCommandDscUuid = BLE_UUID16_INIT(0x2901);

/** Data Notification (Server to Client) characteristic */
const ble_uuid128_t gattDataNotificationChrUuid
    = BLE_UUID128_INIT(0x11, 0x19, 0x0d, 0x0c, 0x0b, 0x0a, 0x09, 0x08, 0x07, 0x06, 0x05, 0x04, 0x03, 0x02, 0x01, 0x00);

/** Data Notification (Server to Client) descriptor */
const ble_uuid16_t gattDataNotificationDscUuid = BLE_UUID16_INIT(0x2901);

/** Fast OTA characteristic */
const ble_uuid128_t gattFastOtaChrUuid
    = BLE_UUID128_INIT(0x15, 0x19, 0x0d, 0x0c, 0x0b, 0x0a, 0x09, 0x08, 0x07, 0x06, 0x05, 0x04, 0x03, 0x02, 0x01, 0x00);

/** Fast OTA descriptor */
const ble_uuid16_t gattFastOtaDscUuid = BLE_UUID16_INIT(0x2901);


static const ble_uuid128_t Nanoleaf_BLE_UUID =
    BLE_UUID128_INIT(0x02, 0x00, 0x13, 0xac, 0x42, 0x02, 0x37, 0xbb, 0xea, 0x11, 0xea, 0x9a, 0xc4, 0xe1, 0x2a, 0x6d);

static const ble_uuid128_t Nanoleaf_OTA_UUID =
    BLE_UUID128_INIT(0xb3, 0x0c, 0x79, 0x78, 0x82, 0x56, 0x4d, 0xb8, 0x83, 0x8b, 0x1f, 0xa7, 0x77, 0xc6, 0x9c, 0x0e);

#if CHIP_ENABLE_ADDITIONAL_DATA_ADVERTISING
const ble_uuid128_t UUID_CHIPoBLEChar_C3 = {
    { BLE_UUID_TYPE_128 }, { 0x04, 0x8F, 0x21, 0x83, 0x8A, 0x74, 0x7D, 0xB8, 0xF2, 0x45, 0x72, 0x87, 0x38, 0x02, 0x63, 0x64 }
};
#endif

SemaphoreHandle_t semaphoreHandle = NULL;

// LE Random Device Address
// (see Bluetooth® Core Specification 4.2 Vol 6, Part B, Section 1.3.2.1 "Static device address")
uint8_t own_addr_type = BLE_OWN_ADDR_RANDOM;

} // unnamed namespace

#if CONFIG_ENABLE_ESP32_BLE_CONTROLLER
ChipDeviceScanner & mDeviceScanner = Internal::ChipDeviceScanner::GetInstance();
#endif
struct ble_instance_cb_register ble_instance_cb[BLE_ADV_INSTANCES];
int ble_connectable_ext_cb(uint16_t instance);
int ble_matter_ext_cb(uint16_t instance);
static uint16_t adv_instance;

/* In ble_data_pattern first two bytes reserved for comapnyID, next 4B for ModelNumber,
 3B for firmwareVersion, 3B for HardwareVersion, 1B for flags */

const ble_uuid128_t ble_data_pattern = { BLE_UUID_TYPE_128, { 0x0b, 0x08, 0xaa ,0xaa, 0x11, 0x11, 0xbb ,0xbb, 0x22, 0xaa, 0xbb, 0x12, 0x01 } };
const ble_uuid128_t ble_name_pattern = { BLE_UUID_TYPE_128, { 'N', 'L', '-', 'B', 'L', 'E'  } };

BLEManagerImpl BLEManagerImpl::sInstance;
const struct ble_gatt_svc_def BLEManagerImpl::CHIPoBLEGATTAttrs[] = {
    { .type = BLE_GATT_SVC_TYPE_PRIMARY,
      .uuid = (ble_uuid_t *) (&ShortUUID_CHIPoBLEService),
      .characteristics =
          (struct ble_gatt_chr_def[]){
              {
                  .uuid       = (ble_uuid_t *) (&UUID128_CHIPoBLEChar_RX),
                  .access_cb  = gatt_svr_chr_access,
                  .flags      = BLE_GATT_CHR_F_WRITE,
                  .val_handle = &sInstance.mRXCharAttrHandle,
              },
              {
                  .uuid       = (ble_uuid_t *) (&UUID_CHIPoBLEChar_TX),
                  .access_cb  = gatt_svr_chr_access,
                  .flags      = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_INDICATE,
                  .val_handle = &sInstance.mTXCharCCCDAttrHandle,
              },
#if CHIP_ENABLE_ADDITIONAL_DATA_ADVERTISING
              {
                  .uuid       = (ble_uuid_t *) (&UUID_CHIPoBLEChar_C3),
                  .access_cb  = gatt_svr_chr_access_additional_data,
                  .flags      = BLE_GATT_CHR_F_READ,
                  .val_handle = &sInstance.mC3CharAttrHandle,
              },
#endif
              {
                  0, /* No more characteristics in this service */
              },
          } },
                 /*** Service ***/
    { .type = BLE_GATT_SVC_TYPE_PRIMARY,
      .uuid = &gattSvrSvcUuid.u,
      .characteristics =
          (struct ble_gatt_chr_def[]) {
            {
                .uuid = &gattPairingChrUuid.u,
                .access_cb = BlePairingChr::gattPairingChrAccessWrapper,
                .descriptors = (struct ble_gatt_dsc_def[]) {
                    {
                        .uuid = &gattPairingDscUuid.u,
                        .att_flags = BLE_ATT_F_READ,
                        .access_cb = BlePairingChr::gattPairingChrAccessWrapper,
                    },
                    {
                        nullptr, /* No more descriptors in this characteristic */
                    } },
                .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE,
                .val_handle = nullptr,
            },
            {
                .uuid = &gattDataCommandChrUuid.u,
                .access_cb = BleDataCommandChr::gattDataCommandChrAccessWrapper,
                .descriptors = (struct ble_gatt_dsc_def[]) { {
                                                                 .uuid = &gattDataCommandDscUuid.u,
                                                                 .att_flags = BLE_ATT_F_READ,
                                                                 .access_cb = BleDataCommandChr::gattDataCommandChrAccessWrapper,
                                                             },
                    {
                        nullptr, /* No more descriptors in this characteristic */
                    } },
                .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE | BLE_GATT_CHR_F_WRITE_NO_RSP,
                .val_handle = nullptr,
            },
            {
                .uuid = &gattDataNotificationChrUuid.u,
                .access_cb = BleDataNotificationChr::gattDataNotificationChrAccess,
                .descriptors = (struct ble_gatt_dsc_def[]) { {
                                                                 .uuid = &gattDataNotificationDscUuid.u,
                                                                 .att_flags = BLE_ATT_F_READ,
                                                                 .access_cb = BleDataNotificationChr::gattDataNotificationChrAccess,
                                                             },
                    {
                        nullptr, /* No more descriptors in this characteristic */
                    } },
                .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE | BLE_GATT_CHR_F_NOTIFY,
                .val_handle = &BleDataNotificationChr::_dataNotificationChrAttrHandle,
            },
            {
                .uuid = &gattFastOtaChrUuid.u,
                .access_cb = BleFastOtaChr::gattFastOtaChrAccess,
                .descriptors = (struct ble_gatt_dsc_def[]) { {
                                                                 .uuid = &gattFastOtaDscUuid.u,
                                                                 .att_flags = BLE_ATT_F_READ,
                                                                 .access_cb = BleFastOtaChr::gattFastOtaChrAccess,
                                                             },
                    {
                        nullptr, /* No more descriptors in this characteristic */
                    } },
                .flags = BLE_GATT_CHR_F_READ | BLE_GATT_CHR_F_WRITE_NO_RSP,
                .val_handle = nullptr,
            },
            {
                nullptr, /* No more characteristics in this service. */
            } },
     },
    {
        .type = BLE_GATT_SVC_TYPE_PRIMARY,
        .uuid = &Nanoleaf_BLE_UUID.u,
    },
    {
        .type = BLE_GATT_SVC_TYPE_PRIMARY,
        .uuid = &Nanoleaf_OTA_UUID.u,
    },
    {
        0, /* No more services. */
    },
};

#if CONFIG_ENABLE_ESP32_BLE_CONTROLLER
void BLEManagerImpl::HandleConnectFailed(CHIP_ERROR error)
{
    if (sInstance.mIsCentral)
    {
        ChipDeviceEvent event;
        event.Type                                    = DeviceEventType::kPlatformESP32BLECentralConnectFailed;
        event.Platform.BLECentralConnectFailed.mError = error;
        PlatformMgr().PostEventOrDie(&event);
    }
}

void BLEManagerImpl::CancelConnect(void)
{
    int rc = ble_gap_conn_cancel();
    VerifyOrReturn(rc == 0, ChipLogError(Ble, "Failed to cancel connection rc=%d", rc));
}

void BLEManagerImpl::HandleConnectTimeout(chip::System::Layer *, void * context)
{
    CancelConnect();
    BLEManagerImpl::HandleConnectFailed(CHIP_ERROR_TIMEOUT);
}

void BLEManagerImpl::ConnectDevice(const ble_addr_t & addr, uint16_t timeout)
{
    int rc;
    uint8_t ownAddrType;

    rc = ble_hs_id_infer_auto(0, &ownAddrType);
    if (rc != 0)
    {
        ChipLogError(Ble, "Failed to infer own address type rc=%d", rc);
        return;
    }

    rc = ble_gap_connect(ownAddrType, &addr, (timeout * 1000), NULL, ble_svr_gap_event, NULL);
    if (rc != 0)
    {
        ChipLogError(Ble, "Failed to connect to rc=%d", rc);
    }
}

void HandleIncomingBleConnection(BLEEndPoint * bleEP)
{
    ChipLogProgress(DeviceLayer, "CHIPoBLE connection received");
}
#endif

CHIP_ERROR BLEManagerImpl::_Init()
{
    CHIP_ERROR err;

    // Initialize the Chip BleLayer.
#if CONFIG_ENABLE_ESP32_BLE_CONTROLLER
    err = BleLayer::Init(this, this, this, &DeviceLayer::SystemLayer());
#else
    err = BleLayer::Init(this, this, &DeviceLayer::SystemLayer());
#endif
    SuccessOrExit(err);

    mRXCharAttrHandle = 0;
#if CHIP_ENABLE_ADDITIONAL_DATA_ADVERTISING
    mC3CharAttrHandle = 0;
#endif
    mTXCharCCCDAttrHandle = 0;
#if CONFIG_ENABLE_ESP32_BLE_CONTROLLER
    mFlags.ClearAll().Set(Flags::kAdvertisingEnabled, CHIP_DEVICE_CONFIG_CHIPOBLE_ENABLE_ADVERTISING_AUTOSTART && !mIsCentral);
    mFlags.Set(Flags::kFastAdvertisingEnabled, !mIsCentral);
    OnChipBleConnectReceived = HandleIncomingBleConnection;
#else
    mFlags.ClearAll().Set(Flags::kAdvertisingEnabled, CHIP_DEVICE_CONFIG_CHIPOBLE_ENABLE_ADVERTISING_AUTOSTART);
    mFlags.Set(Flags::kFastAdvertisingEnabled, true);

#endif
    mNumGAPCons = 0;
    memset(reinterpret_cast<void *>(mCons), 0, sizeof(mCons));
    mServiceMode = ConnectivityManager::kCHIPoBLEServiceMode_Enabled;
    memset(mDeviceName, 0, sizeof(mDeviceName));

    PlatformMgr().ScheduleWork(DriveBLEState, 0);

