Jerry-ESP/esp-matter/awox_light/common/platform/ESP32_custom/nimble/BLEManagerImpl.cpp
    /* get mbuf for adv rsp data */
    data_rsp = os_msys_get_pkthdr(size_pattern_rsp, 0);
    assert(data_rsp);

    /* fill mbuf with adv rsp data */
    rc = os_mbuf_append(data_rsp, pattern_rsp, size_pattern_rsp);
    assert(rc == 0);

    rc = ble_gap_ext_adv_rsp_set_data(instance, data_rsp);
    assert (rc == 0);

    /* start advertising */
    rc = ble_gap_ext_adv_start(instance, duration, 0);
    assert (rc == 0);

    ESP_LOGI(TAG, "Instance %d started", instance);
}

CHIP_ERROR BLEManagerImpl::StartAdvertising(void)
{
    CHIP_ERROR err;
    uint16_t instance = 0;
    struct ble_gap_ext_adv_params params;
    uint8_t index = 0;
    uint8_t advData[MAX_ADV_DATA_LEN];
    constexpr uint8_t kServiceDataTypeSize = 1;
    int size_pattern = sizeof(advData);
    uint16_t discriminator;

    /* use defaults for non-set params */
    memset (&params, 0, sizeof(params));

    /* enable connectable advertising */
    params.connectable = 1;
    params.scannable = 1;
    params.legacy_pdu = 1;

    /* advertise using random addr */
    params.own_addr_type = BLE_OWN_ADDR_RANDOM;

    params.sid = 0;

    if (mFlags.Has(Flags::kFastAdvertisingEnabled))
    {
        params.itvl_min = CHIP_DEVICE_CONFIG_BLE_FAST_ADVERTISING_INTERVAL_MIN;
        params.itvl_max = CHIP_DEVICE_CONFIG_BLE_FAST_ADVERTISING_INTERVAL_MAX;
    }
    else
    {
        params.itvl_min = CHIP_DEVICE_CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MIN;
        params.itvl_max = CHIP_DEVICE_CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MAX;
    }

    // params.itvl_min = BLE_GAP_ADV_FAST_INTERVAL1_MIN;
    // params.itvl_max = BLE_GAP_ADV_FAST_INTERVAL1_MAX;

    memset(advData, 0, sizeof(advData));
    advData[index++] = 0x02;                                                                // length
    advData[index++] = CHIP_ADV_DATA_TYPE_FLAGS;                                            // AD type : flags
    advData[index++] = CHIP_ADV_DATA_FLAGS;                                                 // AD value
    advData[index++] = kServiceDataTypeSize + sizeof(ESP32ChipServiceData);                 // length
    advData[index++] = CHIP_ADV_DATA_TYPE_SERVICE_DATA;                                     // AD type: (Service Data - 16-bit UUID)
    advData[index++] = static_cast<uint8_t>(ShortUUID_CHIPoBLEService.value & 0xFF);        // AD value
    advData[index++] = static_cast<uint8_t>((ShortUUID_CHIPoBLEService.value >> 8) & 0xFF); // AD value

    SuccessOrExit(err = GetCommissionableDataProvider()->GetSetupDiscriminator(discriminator));

    if (!mFlags.Has(Flags::kUseCustomDeviceName))
        {
        snprintf(mDeviceName, sizeof(mDeviceName), "%s%04u", CHIP_DEVICE_CONFIG_BLE_DEVICE_NAME_PREFIX, discriminator);
        mDeviceName[kMaxDeviceNameLength] = 0;
        }

    chip::Ble::ChipBLEDeviceIdentificationInfo deviceIdInfo;

    err = ConfigurationMgr().GetBLEDeviceIdentificationInfo(deviceIdInfo);
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "GetBLEDeviceIdentificationInfo(): %s", ErrorStr(err));
        return err;
    }
    // Configure the BLE device name.
    // err = MapBLEError(ble_svc_gap_device_name_set(mDeviceName));
    // if (err != CHIP_NO_ERROR)
    // {
    //     ChipLogError(DeviceLayer, "ble_svc_gap_device_name_set() failed: %s", ErrorStr(err));
    //     return err;
    // }

#if CHIP_ENABLE_ADDITIONAL_DATA_ADVERTISING
    deviceIdInfo.SetAdditionalDataFlag(true);
#endif

    VerifyOrExit(index + sizeof(deviceIdInfo) <= sizeof(advData), err = CHIP_ERROR_OUTBOUND_MESSAGE_TOO_BIG);
    memcpy(&advData[index], &deviceIdInfo, sizeof(deviceIdInfo));
    index = static_cast<uint8_t>(index + sizeof(deviceIdInfo));

        if (ble_gap_ext_adv_active(instance))
        {
            /* Advertising is already active. Stop and restart with the new parameters */
            ChipLogProgress(DeviceLayer, "Device already advertising, stop active advertisement and restart");
            err = MapBLEError(ble_gap_ext_adv_stop(instance));
            if (err != CHIP_NO_ERROR)
            {
                ChipLogError(DeviceLayer, "ble_gap_ext_adv_stop() failed: %s, cannot restart", ErrorStr(err));
                return err;
            }
        }
#if CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY
        else
        {
            err = MapBLEError(ble_hs_pvcy_rpa_config(NIMBLE_HOST_ENABLE_RPA));
            if (err != CHIP_NO_ERROR)
            {
                ChipLogError(DeviceLayer, "RPA not set: %s", ErrorStr(err));
                return err;
            }
        }
#endif
        ble_multi_adv_conf_set_addr(instance, &params, advData, size_pattern, 0);
        ble_instance_cb[instance].cb = &ble_matter_ext_cb;
        if (err == CHIP_NO_ERROR)
        {
            return CHIP_NO_ERROR;
        }
        else
        {
            ChipLogError(DeviceLayer, "ble_gap_ext_adv_start() failed: %s", ErrorStr(err));
            return err;
        }

exit:
    return err;
}

void BLEManagerImpl::AwoxBleAdvertising(bool advertise)
{
    uint8_t instance = 1;
    if (advertise && (ble_gap_ext_adv_active(instance) == 0)) {
        ble_gap_ext_adv_params advParams;
        uint8_t index = 0;
        uint8_t index_rsp = 0;
        uint8_t advData[MAX_ADV_DATA_LEN];
        uint8_t advRspData[MAX_ADV_DATA_LEN];
        int size_pattern = sizeof(advData);
        int size_pattern_rsp = sizeof(advRspData);
        const char* name;
        int result;

        /**
         *  Set the advertisement data included in our advertisements:
         *     o Flags (Limited discoverability and BLE-only (BR/EDR unsupported))
         *     o 16-bit service UUIDs
         *     o Device name
         *     o Manufacturer Data (Product ID + Mini MAC)
         */
        memset(advData, 0, sizeof(advData));
        advData[index++] = 0x02;
        advData[index++] = 0x01;
        advData[index++] = BLE_HS_ADV_F_DISC_LTD | BLE_HS_ADV_F_BREDR_UNSUP;

        advData[index++] = 0x03;
        advData[index++] = 0x02;
        advData[index++] = GATT_SVR_GENERIC_ACCESS_SVC & 0x00FF;
        advData[index++] = GATT_SVR_GENERIC_ACCESS_SVC >> 8;

        /* Set complete name */
        name = ble_svc_gap_device_name();

        advData[index++] = 0x09;
        advData[index++] = 0x09;
        memcpy(&advData[index], name, DEVICE_NAME_SIZE);
        index += DEVICE_NAME_SIZE;

        /* Set manufacturer data */
        uint8_t mac_addr[MAC_ADDRESS_SIZE] = {0};
        BleManager::getInstance()->getMacAddress(mac_addr);
        auto manufData = manufacturerData_t();
        memcpy(manufData.macAddress, mac_addr, MAC_ADDRESS_SIZE);
        advData[index++] = 9;
        advData[index++] = 0xFF;
        memcpy(&advData[index], &manufData, sizeof(manufacturerData_t));
        index += sizeof(manufacturerData_t);

        size_pattern = index - 2;

