Jerry-ESP/esp-matter/awox_light/common/platform/ESP32_custom/nimble/BLEManagerImpl.cpp
        /* Set Scan response data */
        memset(advRspData, 0, sizeof(advRspData));
        advRspData[index_rsp++] = 0x1E;
        advRspData[index_rsp++] = 0xFF;
        auto scanRespData = scanRespData_t();

        /* Set Manufacturer Data */
        memcpy(&scanRespData.manufData, &manufData, sizeof(manufacturerData_t));

        /* Set Zigbee Address */
        scanRespData.zigbeeAddress = 0;

        /* Set Provisioned State */
        scanRespData.zbProvisionedState = BasicBle::getInstance()->getBlePairingInfo().zbProvisionedState;

        scanRespData.rtcState = 0;

        memcpy(&advRspData[index_rsp], &scanRespData, sizeof(scanRespData_t));

        index_rsp += sizeof(scanRespData_t);

        advRspData[0] = sizeof(scanRespData_t) + 1;

        size_pattern_rsp = index_rsp;

        /* Begin advertising */
        memset(&advParams, 0, sizeof advParams);
        advParams.connectable = 1;
        advParams.scannable = 1;
        advParams.legacy_pdu = 1;

        advParams.sid = 0;
        advParams.itvl_min = BLE_GAP_ADV_ITVL_MS(300);
        advParams.itvl_max = BLE_GAP_ADV_ITVL_MS(305);
        advParams.own_addr_type = BLE_OWN_ADDR_RANDOM;

        ble_multi_adv_conf_set_addr_with_rsp(instance, &advParams, advData,
                           size_pattern, advRspData, size_pattern_rsp, 0);
        ble_instance_cb[instance].cb = &ble_connectable_ext_cb;
        ESP_LOGI(TAG, "ADVERTISE");
    } else if (!advertise) {
        ble_gap_ext_adv_stop(instance);
    } else {
        ESP_LOGI(TAG, "Advertisment already started");
    }
}

CHIP_ERROR BLEManagerImpl::StartAdvertisingBleExt(void)
{
    AwoxBleAdvertising(true);
    return CHIP_NO_ERROR;
}

int ble_connectable_ext_cb(uint16_t instance)
{
    adv_instance = instance;
    ESP_LOGI(TAG, "In %s, instance = %d", __func__, instance);
    return 0;
}

int ble_matter_ext_cb(uint16_t instance)
{
    adv_instance = instance;
    ESP_LOGI(TAG, "In %s, instance = %d", __func__, instance);
    return 0;
}

CHIP_ERROR BLEManagerImpl::StartMultiAdvertising(void)
{
    CHIP_ERROR err;
    err = StartAdvertising();
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "Start matter advertising failed: %s", ErrorStr(err));
        return err;
    }
    err = StartAdvertisingBleExt();
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "Start ble_ext advertising failed: %s", ErrorStr(err));
        return err;
    }
    return CHIP_NO_ERROR;
}

void BLEManagerImpl::DriveBLEState(intptr_t arg)
{
    sInstance.DriveBLEState();
}

#if CONFIG_ENABLE_ESP32_BLE_CONTROLLER
CHIP_ERROR BLEManagerImpl::HandleRXNotify(struct ble_gap_event * ble_event)
{
    uint8_t * data                 = OS_MBUF_DATA(ble_event->notify_rx.om, uint8_t *);
    size_t dataLen                 = OS_MBUF_PKTLEN(ble_event->notify_rx.om);
    System::PacketBufferHandle buf = System::PacketBufferHandle::NewWithData(data, dataLen);
    VerifyOrReturnError(!buf.IsNull(), CHIP_ERROR_NO_MEMORY);

    ChipLogDetail(DeviceLayer, "Indication received, conn = %d", ble_event->notify_rx.conn_handle);

    ChipDeviceEvent event;
    event.Type                                       = DeviceEventType::kPlatformESP32BLEIndicationReceived;
    event.Platform.BLEIndicationReceived.mConnection = ble_event->notify_rx.conn_handle;
    event.Platform.BLEIndicationReceived.mData       = std::move(buf).UnsafeRelease();
    PlatformMgr().PostEventOrDie(&event);

    return CHIP_NO_ERROR;
}

CHIP_ERROR BLEManagerImpl::ConfigureBle(uint32_t aAdapterId, bool aIsCentral)
{
    mBLEAdvConfig.mpBleName         = mDeviceName;
    mBLEAdvConfig.mAdapterId        = aAdapterId;
    mBLEAdvConfig.mMajor            = 1;
    mBLEAdvConfig.mMinor            = 1;
    mBLEAdvConfig.mVendorId         = 1;
    mBLEAdvConfig.mProductId        = 1;
    mBLEAdvConfig.mDeviceId         = 1;
    mBLEAdvConfig.mDuration         = 2;
    mBLEAdvConfig.mPairingStatus    = 0;
    mBLEAdvConfig.mType             = 1;
    mBLEAdvConfig.mpAdvertisingUUID = "0xFFF6";

    mIsCentral = aIsCentral;
    if (mIsCentral)
    {
        int rc = peer_init(MYNEWT_VAL(BLE_MAX_CONNECTIONS), 64, 64, 64);
        assert(rc == 0);
    }

    return CHIP_NO_ERROR;
}

void BLEManagerImpl::OnDeviceScanned(const struct ble_hs_adv_fields & fields, const ble_addr_t & addr,
                                     const chip::Ble::ChipBLEDeviceIdentificationInfo & info)
{

    if (mBLEScanConfig.mBleScanState == BleScanState::kScanForDiscriminator)
    {
        if (!mBLEScanConfig.mDiscriminator.MatchesLongDiscriminator(info.GetDeviceDiscriminator()))
        {
            return;
        }
        ChipLogProgress(Ble, "Device Discriminator match. Attempting to connect");
    }
    else if (mBLEScanConfig.mBleScanState == BleScanState::kScanForAddress)
    {
        ChipLogProgress(Ble, "Device Address match. Attempting to connect");
    }
    else
    {
        ChipLogProgress(Ble, "Unknown discovery type. Ignoring");
    }

    mBLEScanConfig.mBleScanState = BleScanState::kConnecting;
    chip::DeviceLayer::PlatformMgr().LockChipStack();
    DeviceLayer::SystemLayer().StartTimer(System::Clock::Seconds16(kConnectTimeout), HandleConnectTimeout, nullptr);
    chip::DeviceLayer::PlatformMgr().UnlockChipStack();

    mDeviceScanner.StopScan();

    ConnectDevice(addr, kConnectTimeout);
}

void BLEManagerImpl::OnScanComplete()
{
    if (mBLEScanConfig.mBleScanState != BleScanState::kScanForDiscriminator &&
        mBLEScanConfig.mBleScanState != BleScanState::kScanForAddress)
    {
        ChipLogProgress(Ble, "Scan complete notification without an active scan");
        return;
    }

    BleConnectionDelegate::OnConnectionError(mBLEScanConfig.mAppState, CHIP_ERROR_TIMEOUT);
    mBLEScanConfig.mBleScanState = BleScanState::kNotScanning;
}

void BLEManagerImpl::InitiateScan(BleScanState scanType)
{
    DriveBLEState();

    // Check for a valid scan type
    if (scanType == BleScanState::kNotScanning)
    {
        BleConnectionDelegate::OnConnectionError(mBLEScanConfig.mAppState, CHIP_ERROR_INCORRECT_STATE);
        ChipLogError(Ble, "Invalid scan type requested");
        return;
    }

